Autodesk.Revit.DB.ExportUnit
An enumerated type listing possible target units for CAD Export.

Autodesk.Revit.DB.ExportUnit.Meter
Meters as decimal values.

Autodesk.Revit.DB.ExportUnit.Centimeter
Centimeters as decimal values.

Autodesk.Revit.DB.ExportUnit.Millimeter
Millimeters as decimal values.

Autodesk.Revit.DB.ExportUnit.Foot
Feet and Inches in fractional notation.

Autodesk.Revit.DB.ExportUnit.Inch
Inches in fractional notation.

Autodesk.Revit.DB.ExportUnit.Default
Default export unit. Depends on Revit's current units.